analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/smon_regs.h
#define MXC_F_SMON_MEUCFG_ENC_REG4_POS                 4 /**< MEUCFG_ENC_REG4 Position */
#define MXC_F_SMON_MEUCFG_ENC_REG4                     ((uint32_t)(0x1UL << MXC_F_SMON_MEUCFG_ENC_REG4_POS)) /**< MEUCFG_ENC_REG4 Mask */

#define MXC_F_SMON_MEUCFG_ENC_REG5_POS                 5 /**< MEUCFG_ENC_REG5 Position */
#define MXC_F_SMON_MEUCFG_ENC_REG5                     ((uint32_t)(0x1UL << MXC_F_SMON_MEUCFG_ENC_REG5_POS)) /**< MEUCFG_ENC_REG5 Mask */

#define MXC_F_SMON_MEUCFG_ENC_REG6_POS                 6 /**< MEUCFG_ENC_REG6 Position */
#define MXC_F_SMON_MEUCFG_ENC_REG6                     ((uint32_t)(0x1UL << MXC_F_SMON_MEUCFG_ENC_REG6_POS)) /**< MEUCFG_ENC_REG6 Mask */

#define MXC_F_SMON_MEUCFG_ENC_REG7_POS                 7 /**< MEUCFG_ENC_REG7 Position */
#define MXC_F_SMON_MEUCFG_ENC_REG7                     ((uint32_t)(0x1UL << MXC_F_SMON_MEUCFG_ENC_REG7_POS)) /**< MEUCFG_ENC_REG7 Mask */

#define MXC_F_SMON_MEUCFG_LOCK_POS                     31 /**< MEUCFG_LOCK Position */
#define MXC_F_SMON_MEUCFG_LOCK                         ((uint32_t)(0x1UL << MXC_F_SMON_MEUCFG_LOCK_POS)) /**< MEUCFG_LOCK Mask */

/**@} end of group SMON_MEUCFG_Register */

/**
 * @ingroup  smon_registers
 * @defgroup SMON_SECST SMON_SECST
 * @brief    Security Monitor Status Register.
 * @{
 */
#define MXC_F_SMON_SECST_EXTSRS_POS                    0 /**< SECST_EXTSRS Position */
#define MXC_F_SMON_SECST_EXTSRS                        ((uint32_t)(0x1UL << MXC_F_SMON_SECST_EXTSRS_POS)) /**< SECST_EXTSRS Mask */

#define MXC_F_SMON_SECST_INTSRS_POS                    1 /**< SECST_INTSRS Position */
#define MXC_F_SMON_SECST_INTSRS                        ((uint32_t)(0x1UL << MXC_F_SMON_SECST_INTSRS_POS)) /**< SECST_INTSRS Mask */

#define MXC_F_SMON_SECST_SECALRS_POS                   2 /**< SECST_SECALRS Position */
#define MXC_F_SMON_SECST_SECALRS                       ((uint32_t)(0x1UL << MXC_F_SMON_SECST_SECALRS_POS)) /**< SECST_SECALRS Mask */

#define MXC_F_SMON_SECST_MEUCFG_POS                    4 /**< SECST_MEUCFG Position */
#define MXC_F_SMON_SECST_MEUCFG                        ((uint32_t)(0x1UL << MXC_F_SMON_SECST_MEUCFG_POS)) /**< SECST_MEUCFG Mask */

/**@} end of group SMON_SECST_Register */

/**
 * @ingroup  smon_registers
 * @defgroup SMON_SDBE SMON_SDBE
 * @brief    Security Monitor Self Destruct Byte.
 * @{
 */
#define MXC_F_SMON_SDBE_DBYTE_POS                      0 /**< SDBE_DBYTE Position */
#define MXC_F_SMON_SDBE_DBYTE                          ((uint32_t)(0xFFUL << MXC_F_SMON_SDBE_DBYTE_POS)) /**< SDBE_DBYTE Mask */

#define MXC_F_SMON_SDBE_SBDEN_POS                      31 /**< SDBE_SBDEN Position */
#define MXC_F_SMON_SDBE_SBDEN                          ((uint32_t)(0x1UL << MXC_F_SMON_SDBE_SBDEN_POS)) /**< SDBE_SBDEN Mask */

/**@} end of group SMON_SDBE_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32570_INCLUDE_SMON_REGS_H_
